{
  "vocab_size": 500,
  "blank_id": 0,
  "id_to_gloss": {
    "1": "a lot",
    "2": "abdomen",
    "3": "able",
    "4": "about",
    "5": "above",
    "6": "accent",
    "7": "accept",
    "8": "accident",
    "9": "accomplish",
    "10": "accountant",
    "11": "across",
    "12": "act",
    "13": "action",
    "14": "active",
    "15": "activity",
    "16": "actor",
    "17": "adapt",
    "18": "add",
    "19": "address",
    "20": "adjective",
    "21": "adjust",
    "22": "admire",
    "23": "admit",
    "24": "adopt",
    "25": "adult",
    "26": "advanced",
    "27": "adverb",
    "28": "affect",
    "29": "afraid",
    "30": "africa",
    "31": "after",
    "32": "afternoon",
    "33": "again",
    "34": "against",
    "35": "age",
    "36": "agenda",
    "37": "ago",
    "38": "agree",
    "39": "agreement",
    "40": "ahead",
    "41": "aid",
    "42": "aim",
    "43": "airplane",
    "44": "alarm",
    "45": "alcohol",
    "46": "algebra",
    "47": "all",
    "48": "all day",
    "49": "allergy",
    "50": "alligator",
    "51": "allow",
    "52": "almost",
    "53": "alone",
    "54": "already",
    "55": "also",
    "56": "always",
    "57": "amazing",
    "58": "america",
    "59": "amputate",
    "60": "analyze",
    "61": "anatomy",
    "62": "and",
    "63": "angel",
    "64": "angle",
    "65": "angry",
    "66": "animal",
    "67": "anniversary",
    "68": "announce",
    "69": "annoy",
    "70": "another",
    "71": "answer",
    "72": "anyway",
    "73": "apart",
    "74": "apartment",
    "75": "apostrophe",
    "76": "appear",
    "77": "appetite",
    "78": "apple",
    "79": "appointment",
    "80": "appreciate",
    "81": "approach",
    "82": "appropriate",
    "83": "approve",
    "84": "april",
    "85": "archery",
    "86": "area",
    "87": "argue",
    "88": "arm",
    "89": "army",
    "90": "around",
    "91": "arrest",
    "92": "arrive",
    "93": "arrogant",
    "94": "art",
    "95": "artist",
    "96": "asia",
    "97": "ask",
    "98": "asl",
    "99": "assist",
    "100": "assistant",
    "101": "assume",
    "102": "attend",
    "103": "attention",
    "104": "attitude",
    "105": "attorney",
    "106": "attract",
    "107": "auction",
    "108": "audience",
    "109": "audiologist",
    "110": "audiology",
    "111": "august",
    "112": "aunt",
    "113": "australia",
    "114": "austria",
    "115": "author",
    "116": "authority",
    "117": "autumn",
    "118": "available",
    "119": "average",
    "120": "avoid",
    "121": "awake",
    "122": "aware",
    "123": "away",
    "124": "awful",
    "125": "awkward",
    "126": "baby",
    "127": "babysitter",
    "128": "back",
    "129": "background",
    "130": "backpack",
    "131": "bacon",
    "132": "bad",
    "133": "bake",
    "134": "balance",
    "135": "bald",
    "136": "ball",
    "137": "balloon",
    "138": "banana",
    "139": "baptize",
    "140": "bar",
    "141": "barely",
    "142": "bark",
    "143": "baseball",
    "144": "basement",
    "145": "basketball",
    "146": "bath",
    "147": "bathroom",
    "148": "battle",
    "149": "bear",
    "150": "beard",
    "151": "beautiful",
    "152": "because",
    "153": "become",
    "154": "bed",
    "155": "bedroom",
    "156": "bee",
    "157": "beer",
    "158": "before",
    "159": "beg",
    "160": "beginning",
    "161": "behavior",
    "162": "behind",
    "163": "belief",
    "164": "believe",
    "165": "bell",
    "166": "below",
    "167": "belt",
    "168": "benefit",
    "169": "berry",
    "170": "beside",
    "171": "best",
    "172": "bet",
    "173": "better",
    "174": "between",
    "175": "bible",
    "176": "bicycle",
    "177": "big",
    "178": "bike",
    "179": "biology",
    "180": "bird",
    "181": "birth",
    "182": "birthday",
    "183": "bite",
    "184": "bitter",
    "185": "black",
    "186": "blame",
    "187": "blanket",
    "188": "blend",
    "189": "bless",
    "190": "blind",
    "191": "blood",
    "192": "blow",
    "193": "blue",
    "194": "boast",
    "195": "boat",
    "196": "body",
    "197": "boil",
    "198": "book",
    "199": "bookstore",
    "200": "bored",
    "201": "borrow",
    "202": "boss",
    "203": "both",
    "204": "bother",
    "205": "bottle",
    "206": "bottom",
    "207": "bowl",
    "208": "bowling",
    "209": "box",
    "210": "boxing",
    "211": "boy",
    "212": "boyfriend",
    "213": "bracelet",
    "214": "brag",
    "215": "braid",
    "216": "brain",
    "217": "brave",
    "218": "bread",
    "219": "break",
    "220": "breakfast",
    "221": "breathe",
    "222": "breeze",
    "223": "brief",
    "224": "bright",
    "225": "bring",
    "226": "brochure",
    "227": "broke",
    "228": "brother",
    "229": "brown",
    "230": "brush",
    "231": "buffalo",
    "232": "build",
    "233": "building",
    "234": "bull",
    "235": "bully",
    "236": "burp",
    "237": "bus",
    "238": "bush",
    "239": "business",
    "240": "busy",
    "241": "but",
    "242": "butter",
    "243": "butterfly",
    "244": "button",
    "245": "buy",
    "246": "bye",
    "247": "cabbage",
    "248": "cabinet",
    "249": "cafeteria",
    "250": "cake",
    "251": "calculate",
    "252": "calculator",
    "253": "calculus",
    "254": "california",
    "255": "call",
    "256": "calm",
    "257": "camel",
    "258": "camera",
    "259": "camp",
    "260": "camping",
    "261": "can",
    "262": "canada",
    "263": "cancel",
    "264": "candidate",
    "265": "candle",
    "266": "candy",
    "267": "cannot",
    "268": "canoe",
    "269": "caption",
    "270": "car",
    "271": "card",
    "272": "care",
    "273": "careful",
    "274": "carnival",
    "275": "carrot",
    "276": "carry",
    "277": "cat",
    "278": "catch",
    "279": "category",
    "280": "caterpillar",
    "281": "catholic",
    "282": "cause",
    "283": "ceiling",
    "284": "celebrate",
    "285": "cemetery",
    "286": "cent",
    "287": "center",
    "288": "cereal",
    "289": "certificate",
    "290": "chain",
    "291": "chair",
    "292": "challenge",
    "293": "champion",
    "294": "chance",
    "295": "change",
    "296": "chapter",
    "297": "character",
    "298": "chase",
    "299": "chat",
    "300": "cheap",
    "301": "cheat",
    "302": "check",
    "303": "cheese",
    "304": "chemical",
    "305": "chemistry",
    "306": "cherry",
    "307": "chicken",
    "308": "child",
    "309": "children",
    "310": "china",
    "311": "chocolate",
    "312": "choice",
    "313": "choir",
    "314": "choke",
    "315": "choose",
    "316": "chop",
    "317": "christ",
    "318": "christian",
    "319": "christmas",
    "320": "church",
    "321": "cigarette",
    "322": "circle",
    "323": "city",
    "324": "class",
    "325": "classroom",
    "326": "clean",
    "327": "clear",
    "328": "clever",
    "329": "click",
    "330": "climb",
    "331": "clock",
    "332": "close",
    "333": "closet",
    "334": "clothes",
    "335": "cloud",
    "336": "clown",
    "337": "clueless",
    "338": "clumsy",
    "339": "coach",
    "340": "coat",
    "341": "cochlear implant",
    "342": "coconut",
    "343": "coffee",
    "344": "cold",
    "345": "collect",
    "346": "college",
    "347": "color",
    "348": "comb",
    "349": "come",
    "350": "come here",
    "351": "comfortable",
    "352": "comma",
    "353": "command",
    "354": "comment",
    "355": "commit",
    "356": "committee",
    "357": "common",
    "358": "common sense",
    "359": "community",
    "360": "commute",
    "361": "company",
    "362": "compare",
    "363": "compete",
    "364": "complain",
    "365": "complete",
    "366": "complex",
    "367": "compromise",
    "368": "computer",
    "369": "concern",
    "370": "conflict",
    "371": "confront",
    "372": "confused",
    "373": "congratulations",
    "374": "congress",
    "375": "connect",
    "376": "conquer",
    "377": "consider",
    "378": "constitution",
    "379": "construct",
    "380": "contact",
    "381": "contest",
    "382": "continue",
    "383": "contribute",
    "384": "control",
    "385": "conversation",
    "386": "convert",
    "387": "convince",
    "388": "cook",
    "389": "cookie",
    "390": "cool",
    "391": "cop",
    "392": "copy",
    "393": "corn",
    "394": "corner",
    "395": "correct",
    "396": "cost",
    "397": "couch",
    "398": "cough",
    "399": "counsel",
    "400": "counselor",
    "401": "count",
    "402": "country",
    "403": "court",
    "404": "cousin",
    "405": "cover",
    "406": "cow",
    "407": "crab",
    "408": "cracker",
    "409": "crash",
    "410": "crave",
    "411": "crazy",
    "412": "create",
    "413": "cross",
    "414": "crown",
    "415": "cruel",
    "416": "cry",
    "417": "cup",
    "418": "curious",
    "419": "curriculum",
    "420": "curse",
    "421": "customer",
    "422": "cut",
    "423": "cute",
    "424": "dad",
    "425": "daily",
    "426": "damage",
    "427": "dance",
    "428": "danger",
    "429": "dangerous",
    "430": "dark",
    "431": "date",
    "432": "daughter",
    "433": "dawn",
    "434": "day",
    "435": "dead",
    "436": "deaf",
    "437": "death",
    "438": "debate",
    "439": "debt",
    "440": "december",
    "441": "decide",
    "442": "decorate",
    "443": "decrease",
    "444": "deduct",
    "445": "deep",
    "446": "deer",
    "447": "defeat",
    "448": "defend",
    "449": "degree",
    "450": "delay",
    "451": "delicious",
    "452": "deliver",
    "453": "demand",
    "454": "democrat",
    "455": "demonstrate",
    "456": "dentist",
    "457": "deny",
    "458": "deodorant",
    "459": "depend",
    "460": "deposit",
    "461": "depressed",
    "462": "descend",
    "463": "describe",
    "464": "desert",
    "465": "design",
    "466": "desk",
    "467": "dessert",
    "468": "destroy",
    "469": "develop",
    "470": "diabetes",
    "471": "diamond",
    "472": "diaper",
    "473": "diarrhea",
    "474": "dictionary",
    "475": "different",
    "476": "dig",
    "477": "dime",
    "478": "dining room",
    "479": "dinner",
    "480": "dinosaur",
    "481": "diploma",
    "482": "dirt",
    "483": "dirty",
    "484": "disagree",
    "485": "disappear",
    "486": "discipline",
    "487": "disconnect",
    "488": "discover",
    "489": "discuss",
    "490": "disgust",
    "491": "dissolve",
    "492": "disturb",
    "493": "dive",
    "494": "divide",
    "495": "divorce",
    "496": "doctor",
    "497": "document",
    "498": "dog",
    "499": "doll",
    "500": "dollar"
  },
  "gloss_to_id": {
    "a lot": 1,
    "abdomen": 2,
    "able": 3,
    "about": 4,
    "above": 5,
    "accent": 6,
    "accept": 7,
    "accident": 8,
    "accomplish": 9,
    "accountant": 10,
    "across": 11,
    "act": 12,
    "action": 13,
    "active": 14,
    "activity": 15,
    "actor": 16,
    "adapt": 17,
    "add": 18,
    "address": 19,
    "adjective": 20,
    "adjust": 21,
    "admire": 22,
    "admit": 23,
    "adopt": 24,
    "adult": 25,
    "advanced": 26,
    "adverb": 27,
    "affect": 28,
    "afraid": 29,
    "africa": 30,
    "after": 31,
    "afternoon": 32,
    "again": 33,
    "against": 34,
    "age": 35,
    "agenda": 36,
    "ago": 37,
    "agree": 38,
    "agreement": 39,
    "ahead": 40,
    "aid": 41,
    "aim": 42,
    "airplane": 43,
    "alarm": 44,
    "alcohol": 45,
    "algebra": 46,
    "all": 47,
    "all day": 48,
    "allergy": 49,
    "alligator": 50,
    "allow": 51,
    "almost": 52,
    "alone": 53,
    "already": 54,
    "also": 55,
    "always": 56,
    "amazing": 57,
    "america": 58,
    "amputate": 59,
    "analyze": 60,
    "anatomy": 61,
    "and": 62,
    "angel": 63,
    "angle": 64,
    "angry": 65,
    "animal": 66,
    "anniversary": 67,
    "announce": 68,
    "annoy": 69,
    "another": 70,
    "answer": 71,
    "anyway": 72,
    "apart": 73,
    "apartment": 74,
    "apostrophe": 75,
    "appear": 76,
    "appetite": 77,
    "apple": 78,
    "appointment": 79,
    "appreciate": 80,
    "approach": 81,
    "appropriate": 82,
    "approve": 83,
    "april": 84,
    "archery": 85,
    "area": 86,
    "argue": 87,
    "arm": 88,
    "army": 89,
    "around": 90,
    "arrest": 91,
    "arrive": 92,
    "arrogant": 93,
    "art": 94,
    "artist": 95,
    "asia": 96,
    "ask": 97,
    "asl": 98,
    "assist": 99,
    "assistant": 100,
    "assume": 101,
    "attend": 102,
    "attention": 103,
    "attitude": 104,
    "attorney": 105,
    "attract": 106,
    "auction": 107,
    "audience": 108,
    "audiologist": 109,
    "audiology": 110,
    "august": 111,
    "aunt": 112,
    "australia": 113,
    "austria": 114,
    "author": 115,
    "authority": 116,
    "autumn": 117,
    "available": 118,
    "average": 119,
    "avoid": 120,
    "awake": 121,
    "aware": 122,
    "away": 123,
    "awful": 124,
    "awkward": 125,
    "baby": 126,
    "babysitter": 127,
    "back": 128,
    "background": 129,
    "backpack": 130,
    "bacon": 131,
    "bad": 132,
    "bake": 133,
    "balance": 134,
    "bald": 135,
    "ball": 136,
    "balloon": 137,
    "banana": 138,
    "baptize": 139,
    "bar": 140,
    "barely": 141,
    "bark": 142,
    "baseball": 143,
    "basement": 144,
    "basketball": 145,
    "bath": 146,
    "bathroom": 147,
    "battle": 148,
    "bear": 149,
    "beard": 150,
    "beautiful": 151,
    "because": 152,
    "become": 153,
    "bed": 154,
    "bedroom": 155,
    "bee": 156,
    "beer": 157,
    "before": 158,
    "beg": 159,
    "beginning": 160,
    "behavior": 161,
    "behind": 162,
    "belief": 163,
    "believe": 164,
    "bell": 165,
    "below": 166,
    "belt": 167,
    "benefit": 168,
    "berry": 169,
    "beside": 170,
    "best": 171,
    "bet": 172,
    "better": 173,
    "between": 174,
    "bible": 175,
    "bicycle": 176,
    "big": 177,
    "bike": 178,
    "biology": 179,
    "bird": 180,
    "birth": 181,
    "birthday": 182,
    "bite": 183,
    "bitter": 184,
    "black": 185,
    "blame": 186,
    "blanket": 187,
    "blend": 188,
    "bless": 189,
    "blind": 190,
    "blood": 191,
    "blow": 192,
    "blue": 193,
    "boast": 194,
    "boat": 195,
    "body": 196,
    "boil": 197,
    "book": 198,
    "bookstore": 199,
    "bored": 200,
    "borrow": 201,
    "boss": 202,
    "both": 203,
    "bother": 204,
    "bottle": 205,
    "bottom": 206,
    "bowl": 207,
    "bowling": 208,
    "box": 209,
    "boxing": 210,
    "boy": 211,
    "boyfriend": 212,
    "bracelet": 213,
    "brag": 214,
    "braid": 215,
    "brain": 216,
    "brave": 217,
    "bread": 218,
    "break": 219,
    "breakfast": 220,
    "breathe": 221,
    "breeze": 222,
    "brief": 223,
    "bright": 224,
    "bring": 225,
    "brochure": 226,
    "broke": 227,
    "brother": 228,
    "brown": 229,
    "brush": 230,
    "buffalo": 231,
    "build": 232,
    "building": 233,
    "bull": 234,
    "bully": 235,
    "burp": 236,
    "bus": 237,
    "bush": 238,
    "business": 239,
    "busy": 240,
    "but": 241,
    "butter": 242,
    "butterfly": 243,
    "button": 244,
    "buy": 245,
    "bye": 246,
    "cabbage": 247,
    "cabinet": 248,
    "cafeteria": 249,
    "cake": 250,
    "calculate": 251,
    "calculator": 252,
    "calculus": 253,
    "california": 254,
    "call": 255,
    "calm": 256,
    "camel": 257,
    "camera": 258,
    "camp": 259,
    "camping": 260,
    "can": 261,
    "canada": 262,
    "cancel": 263,
    "candidate": 264,
    "candle": 265,
    "candy": 266,
    "cannot": 267,
    "canoe": 268,
    "caption": 269,
    "car": 270,
    "card": 271,
    "care": 272,
    "careful": 273,
    "carnival": 274,
    "carrot": 275,
    "carry": 276,
    "cat": 277,
    "catch": 278,
    "category": 279,
    "caterpillar": 280,
    "catholic": 281,
    "cause": 282,
    "ceiling": 283,
    "celebrate": 284,
    "cemetery": 285,
    "cent": 286,
    "center": 287,
    "cereal": 288,
    "certificate": 289,
    "chain": 290,
    "chair": 291,
    "challenge": 292,
    "champion": 293,
    "chance": 294,
    "change": 295,
    "chapter": 296,
    "character": 297,
    "chase": 298,
    "chat": 299,
    "cheap": 300,
    "cheat": 301,
    "check": 302,
    "cheese": 303,
    "chemical": 304,
    "chemistry": 305,
    "cherry": 306,
    "chicken": 307,
    "child": 308,
    "children": 309,
    "china": 310,
    "chocolate": 311,
    "choice": 312,
    "choir": 313,
    "choke": 314,
    "choose": 315,
    "chop": 316,
    "christ": 317,
    "christian": 318,
    "christmas": 319,
    "church": 320,
    "cigarette": 321,
    "circle": 322,
    "city": 323,
    "class": 324,
    "classroom": 325,
    "clean": 326,
    "clear": 327,
    "clever": 328,
    "click": 329,
    "climb": 330,
    "clock": 331,
    "close": 332,
    "closet": 333,
    "clothes": 334,
    "cloud": 335,
    "clown": 336,
    "clueless": 337,
    "clumsy": 338,
    "coach": 339,
    "coat": 340,
    "cochlear implant": 341,
    "coconut": 342,
    "coffee": 343,
    "cold": 344,
    "collect": 345,
    "college": 346,
    "color": 347,
    "comb": 348,
    "come": 349,
    "come here": 350,
    "comfortable": 351,
    "comma": 352,
    "command": 353,
    "comment": 354,
    "commit": 355,
    "committee": 356,
    "common": 357,
    "common sense": 358,
    "community": 359,
    "commute": 360,
    "company": 361,
    "compare": 362,
    "compete": 363,
    "complain": 364,
    "complete": 365,
    "complex": 366,
    "compromise": 367,
    "computer": 368,
    "concern": 369,
    "conflict": 370,
    "confront": 371,
    "confused": 372,
    "congratulations": 373,
    "congress": 374,
    "connect": 375,
    "conquer": 376,
    "consider": 377,
    "constitution": 378,
    "construct": 379,
    "contact": 380,
    "contest": 381,
    "continue": 382,
    "contribute": 383,
    "control": 384,
    "conversation": 385,
    "convert": 386,
    "convince": 387,
    "cook": 388,
    "cookie": 389,
    "cool": 390,
    "cop": 391,
    "copy": 392,
    "corn": 393,
    "corner": 394,
    "correct": 395,
    "cost": 396,
    "couch": 397,
    "cough": 398,
    "counsel": 399,
    "counselor": 400,
    "count": 401,
    "country": 402,
    "court": 403,
    "cousin": 404,
    "cover": 405,
    "cow": 406,
    "crab": 407,
    "cracker": 408,
    "crash": 409,
    "crave": 410,
    "crazy": 411,
    "create": 412,
    "cross": 413,
    "crown": 414,
    "cruel": 415,
    "cry": 416,
    "cup": 417,
    "curious": 418,
    "curriculum": 419,
    "curse": 420,
    "customer": 421,
    "cut": 422,
    "cute": 423,
    "dad": 424,
    "daily": 425,
    "damage": 426,
    "dance": 427,
    "danger": 428,
    "dangerous": 429,
    "dark": 430,
    "date": 431,
    "daughter": 432,
    "dawn": 433,
    "day": 434,
    "dead": 435,
    "deaf": 436,
    "death": 437,
    "debate": 438,
    "debt": 439,
    "december": 440,
    "decide": 441,
    "decorate": 442,
    "decrease": 443,
    "deduct": 444,
    "deep": 445,
    "deer": 446,
    "defeat": 447,
    "defend": 448,
    "degree": 449,
    "delay": 450,
    "delicious": 451,
    "deliver": 452,
    "demand": 453,
    "democrat": 454,
    "demonstrate": 455,
    "dentist": 456,
    "deny": 457,
    "deodorant": 458,
    "depend": 459,
    "deposit": 460,
    "depressed": 461,
    "descend": 462,
    "describe": 463,
    "desert": 464,
    "design": 465,
    "desk": 466,
    "dessert": 467,
    "destroy": 468,
    "develop": 469,
    "diabetes": 470,
    "diamond": 471,
    "diaper": 472,
    "diarrhea": 473,
    "dictionary": 474,
    "different": 475,
    "dig": 476,
    "dime": 477,
    "dining room": 478,
    "dinner": 479,
    "dinosaur": 480,
    "diploma": 481,
    "dirt": 482,
    "dirty": 483,
    "disagree": 484,
    "disappear": 485,
    "discipline": 486,
    "disconnect": 487,
    "discover": 488,
    "discuss": 489,
    "disgust": 490,
    "dissolve": 491,
    "disturb": 492,
    "dive": 493,
    "divide": 494,
    "divorce": 495,
    "doctor": 496,
    "document": 497,
    "dog": 498,
    "doll": 499,
    "dollar": 500
  }
}