{
  "vocab_size": 184,
  "blank_id": 0,
  "id_to_gloss": {
    "1": "a",
    "2": "a lot",
    "3": "abdomen",
    "4": "able",
    "5": "about",
    "6": "above",
    "7": "accent",
    "8": "accept",
    "9": "accident",
    "10": "accomplish",
    "11": "accountant",
    "12": "across",
    "13": "act",
    "14": "action",
    "15": "active",
    "16": "activity",
    "17": "actor",
    "18": "adapt",
    "19": "add",
    "20": "address",
    "21": "adjective",
    "22": "adjust",
    "23": "admire",
    "24": "admit",
    "25": "adopt",
    "26": "adult",
    "27": "advanced",
    "28": "advantage",
    "29": "adverb",
    "30": "affect",
    "31": "afraid",
    "32": "africa",
    "33": "after",
    "34": "afternoon",
    "35": "again",
    "36": "against",
    "37": "age",
    "38": "agenda",
    "39": "ago",
    "40": "agree",
    "41": "agreement",
    "42": "ahead",
    "43": "aid",
    "44": "aim",
    "45": "airplane",
    "46": "alarm",
    "47": "alcohol",
    "48": "algebra",
    "49": "all",
    "50": "all day",
    "51": "allergy",
    "52": "alligator",
    "53": "allow",
    "54": "almost",
    "55": "alone",
    "56": "alphabet",
    "57": "already",
    "58": "also",
    "59": "always",
    "60": "amazing",
    "61": "america",
    "62": "amputate",
    "63": "analyze",
    "64": "anatomy",
    "65": "and",
    "66": "angel",
    "67": "angle",
    "68": "angry",
    "69": "animal",
    "70": "anniversary",
    "71": "announce",
    "72": "annoy",
    "73": "another",
    "74": "answer",
    "75": "any",
    "76": "anyway",
    "77": "apart",
    "78": "apartment",
    "79": "apostrophe",
    "80": "appear",
    "81": "appetite",
    "82": "apple",
    "83": "appointment",
    "84": "appreciate",
    "85": "approach",
    "86": "appropriate",
    "87": "approve",
    "88": "april",
    "89": "archery",
    "90": "area",
    "91": "argue",
    "92": "arizona",
    "93": "arm",
    "94": "army",
    "95": "around",
    "96": "arrest",
    "97": "arrive",
    "98": "arrogant",
    "99": "art",
    "100": "article",
    "101": "artist",
    "102": "asia",
    "103": "ask",
    "104": "asl",
    "105": "assist",
    "106": "assistant",
    "107": "assume",
    "108": "attend",
    "109": "attention",
    "110": "attitude",
    "111": "attorney",
    "112": "attract",
    "113": "auction",
    "114": "audience",
    "115": "audiologist",
    "116": "audiology",
    "117": "august",
    "118": "aunt",
    "119": "australia",
    "120": "austria",
    "121": "author",
    "122": "authority",
    "123": "autumn",
    "124": "available",
    "125": "average",
    "126": "avoid",
    "127": "awake",
    "128": "award",
    "129": "aware",
    "130": "away",
    "131": "awful",
    "132": "awkward",
    "133": "baby",
    "134": "babysitter",
    "135": "back",
    "136": "background",
    "137": "backpack",
    "138": "bacon",
    "139": "bad",
    "140": "bake",
    "141": "balance",
    "142": "bald",
    "143": "ball",
    "144": "balloon",
    "145": "banana",
    "146": "bank",
    "147": "baptize",
    "148": "bar",
    "149": "barely",
    "150": "bark",
    "151": "baseball",
    "152": "basement",
    "153": "basic",
    "154": "basketball",
    "155": "bath",
    "156": "bathroom",
    "157": "battery",
    "158": "battle",
    "159": "bear",
    "160": "beard",
    "161": "beautiful",
    "162": "because",
    "163": "become",
    "164": "bed",
    "165": "bedroom",
    "166": "bee",
    "167": "beer",
    "168": "before",
    "169": "beg",
    "170": "beginning",
    "171": "behavior",
    "172": "behind",
    "173": "belief",
    "174": "believe",
    "175": "bell",
    "176": "below",
    "177": "belt",
    "178": "benefit",
    "179": "berry",
    "180": "beside",
    "181": "best",
    "182": "bet",
    "183": "better",
    "184": "between"
  },
  "gloss_to_id": {
    "a": 1,
    "a lot": 2,
    "abdomen": 3,
    "able": 4,
    "about": 5,
    "above": 6,
    "accent": 7,
    "accept": 8,
    "accident": 9,
    "accomplish": 10,
    "accountant": 11,
    "across": 12,
    "act": 13,
    "action": 14,
    "active": 15,
    "activity": 16,
    "actor": 17,
    "adapt": 18,
    "add": 19,
    "address": 20,
    "adjective": 21,
    "adjust": 22,
    "admire": 23,
    "admit": 24,
    "adopt": 25,
    "adult": 26,
    "advanced": 27,
    "advantage": 28,
    "adverb": 29,
    "affect": 30,
    "afraid": 31,
    "africa": 32,
    "after": 33,
    "afternoon": 34,
    "again": 35,
    "against": 36,
    "age": 37,
    "agenda": 38,
    "ago": 39,
    "agree": 40,
    "agreement": 41,
    "ahead": 42,
    "aid": 43,
    "aim": 44,
    "airplane": 45,
    "alarm": 46,
    "alcohol": 47,
    "algebra": 48,
    "all": 49,
    "all day": 50,
    "allergy": 51,
    "alligator": 52,
    "allow": 53,
    "almost": 54,
    "alone": 55,
    "alphabet": 56,
    "already": 57,
    "also": 58,
    "always": 59,
    "amazing": 60,
    "america": 61,
    "amputate": 62,
    "analyze": 63,
    "anatomy": 64,
    "and": 65,
    "angel": 66,
    "angle": 67,
    "angry": 68,
    "animal": 69,
    "anniversary": 70,
    "announce": 71,
    "annoy": 72,
    "another": 73,
    "answer": 74,
    "any": 75,
    "anyway": 76,
    "apart": 77,
    "apartment": 78,
    "apostrophe": 79,
    "appear": 80,
    "appetite": 81,
    "apple": 82,
    "appointment": 83,
    "appreciate": 84,
    "approach": 85,
    "appropriate": 86,
    "approve": 87,
    "april": 88,
    "archery": 89,
    "area": 90,
    "argue": 91,
    "arizona": 92,
    "arm": 93,
    "army": 94,
    "around": 95,
    "arrest": 96,
    "arrive": 97,
    "arrogant": 98,
    "art": 99,
    "article": 100,
    "artist": 101,
    "asia": 102,
    "ask": 103,
    "asl": 104,
    "assist": 105,
    "assistant": 106,
    "assume": 107,
    "attend": 108,
    "attention": 109,
    "attitude": 110,
    "attorney": 111,
    "attract": 112,
    "auction": 113,
    "audience": 114,
    "audiologist": 115,
    "audiology": 116,
    "august": 117,
    "aunt": 118,
    "australia": 119,
    "austria": 120,
    "author": 121,
    "authority": 122,
    "autumn": 123,
    "available": 124,
    "average": 125,
    "avoid": 126,
    "awake": 127,
    "award": 128,
    "aware": 129,
    "away": 130,
    "awful": 131,
    "awkward": 132,
    "baby": 133,
    "babysitter": 134,
    "back": 135,
    "background": 136,
    "backpack": 137,
    "bacon": 138,
    "bad": 139,
    "bake": 140,
    "balance": 141,
    "bald": 142,
    "ball": 143,
    "balloon": 144,
    "banana": 145,
    "bank": 146,
    "baptize": 147,
    "bar": 148,
    "barely": 149,
    "bark": 150,
    "baseball": 151,
    "basement": 152,
    "basic": 153,
    "basketball": 154,
    "bath": 155,
    "bathroom": 156,
    "battery": 157,
    "battle": 158,
    "bear": 159,
    "beard": 160,
    "beautiful": 161,
    "because": 162,
    "become": 163,
    "bed": 164,
    "bedroom": 165,
    "bee": 166,
    "beer": 167,
    "before": 168,
    "beg": 169,
    "beginning": 170,
    "behavior": 171,
    "behind": 172,
    "belief": 173,
    "believe": 174,
    "bell": 175,
    "below": 176,
    "belt": 177,
    "benefit": 178,
    "berry": 179,
    "beside": 180,
    "best": 181,
    "bet": 182,
    "better": 183,
    "between": 184
  }
}